show create table student;
insert into student values
                        (4,'张4',14,'上海4'),
                        (5,'张5',15,'上海5'),
                        (6,'张6',16,'上海6'),
                        (7,'张7',17,'上海7'),
                        (8,'张8',18,'上海8'),
                        (9,'张9',19,'上海9'),
                        (10,'张10',20,'上海10'),
                        (11,'张11',21,'上海11'),
                        (12,'张12',22,'上海12'),
                        (13,'张13',23,'上海13'),
                        (14,'张14',24,'上海14'),
                        (15,'张15',25,'上海15'),
                        (16,'张16',26,'上海16'),
                        (17,'张17',27,'上海17'),
                        (18,'张18',28,'上海18'),
                        (19,'张19',29,'上海19'),
                        (20,'张20',30,'上海20'),
                        (21,'张21',31,'上海21'),
                        (22,'张22',32,'上海22'),
                        (23,'张23',33,'上海23'),
                        (24,'张24',34,'上海24'),
                        (25,'张25',35,'上海25'),
                        (26,'张26',36,'上海26'),
                        (27,'张27',37,'上海27'),
                        (28,'张28',38,'上海28'),
                        (29,'张29',39,'上海29'),
                        (30,'张30',40,'上海30'),
                        (31,'张31',41,'上海31'),
                        (32,'张32',42,'上海32'),
                        (33,'张33',43,'上海33'),
                        (34,'张34',44,'上海34'),
                        (35,'张35',45,'上海35'),
                        (36,'张36',46,'上海36'),
                        (37,'张37',47,'上海37'),
                        (38,'张38',48,'上海38'),
                        (39,'张39',49,'上海39'),
                        (40,'张40',50,'上海40')
                        ;

CREATE TABLE `student` (
                           `id` int NOT NULL AUTO_INCREMENT COMMENT '主键id',
                           `name` varchar(100) NOT NULL COMMENT '学生姓名',
                           `age` int DEFAULT NULL COMMENT '年龄',
                           `address` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT '',
                           PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

select id,student.name,age,address from student;